// 检测24小时制时间
var reg = /^((?:[01]\d|2[0-3])):[0-5]\d:[0-5]\d$)/

// 检测12小时制时间
var reg = /^(1[0-2]|0?[1-9]):[0-5]\d:[0-5]\d$/

// base64格式
var reg = /^\s*data:([a-z]+\/[a-z0-9-+.]+(;[a-z-]+=[a-z0-9-]+)?)?(;base64)?,([a-z0-9!$&',()*+;=\-._~:@\/?%\s]*?)\s*$/i

// 数字/货币金额（支持负数、千分位分隔符）
var reg = /(^[-]?[1-9]\d{0,2}($|(,\d{3})*($|(\.\d{1,2}$))))|((^[0](\.\d{1,2})?)|(^[-][0]\.\d{1,2}))$/

// 数字/货币金额 (只支持正数、不支持校验千分位分隔符
var reg = /(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/

// 银行卡号（16或19位）
var reg = /^([1-9]{1})(\d{15}|\d{18})$/

// 中文姓名
var reg = /^([\u4e00-\u9fa5·]{2,10})$/

// 新能源车牌号
var reg = /[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}(([0-9]{5}[DF])|([DF][A-HJ-NP-Z0-9][0-9]{4}))$/

// 非新能源车牌号
var reg = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/


// 车牌号
var reg = /^([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-HJ-NP-Z]{1}(([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领 A-Z]{1}[A-Z]{1}[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9 挂学警港澳]{1})$/

// URL
var reg = /^((https?|ftp|file):\/\/)?([\da-z.-]+)\.([a-z.]{2,6})(\/\w\.-]*)*\/?/

// 手机号
var reg = /^1((3[\d])|(4[5,6,7,9])|(5[0-3,5-9])|(6[5-7])|(7[0-8])|(8[\d])|(9[1,8,9]))\d{8}$/


// 日期，如2000-01-01或2000-1-1
var reg = /^\d{4}(-)([0-1][0-2]|\d)\1([0-2]\d|\d|30|31)$/

// email地址
var reg = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/

// 二代身份证
var reg = /^\d{6}(18|19|20)\d{2}(0\d|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$/

// 帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线组合
var reg = /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/

// 纯中文
var reg = /^[\u4E00-\u9FA5]+$/

//是否为小数
var reg = /^\d+\.\d+$/

//纯数字
var reg = /^\d{1,}$/

// 是否由数字和字母组成
var reg = /^[A-Za-z0-9]+$/

// 密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
var reg = /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/